unicab369/ch32fun/examples_ch5xx/iSLER_sensors_gateway/iSLER_sensors_gateway.c
// Listen to messages from iSLER_sensor_lowpower_node

#include "ch32fun.h"
#include <stdio.h>
#include "../iSLER_sensor_lowpower_node/ch5xx_Mess.h"

#define LED_PIN PA8

uint8_t frame_info[] = { 0xff, 0x10 }; // PDU, len, (maybe not?) needed in RX mode

void blink(int led_pin, int n) {
	for(int i = n-1; i >= 0; i--) {
		funDigitalWrite(led_pin, 0); // Turn on LED
		Delay_Ms(33);
		funDigitalWrite(led_pin, 1); // Turn off LED
		if(i) Delay_Ms(33);
	}
}

void handle_receiving_frame(uint32_t time) {
	// now listen for frames on channel 37. When the RF subsystem
	// detects and finalizes one, "rx_ready" in iSLER.h is set true
	Frame_RX(frame_info, 37, PHY_MODE);
	while(!rx_ready);
	
	// we stepped over !rx_ready so we got a frame
	remote_command_t* cmd = chMess_rx_handler();
	if (cmd) {
		blink(LED_PIN, 1);
		printf("\n\nReceiv Command: %02X", cmd->command);
		printf("\nValue1: %u", cmd->value1);
		printf("\nValue2: %u", cmd->value2);
		printf("\nValue3: %u", cmd->value3);
	}
}


int main() {
    SystemInit();

	printf("~ iSLER sensors gateway ~\n");
	RFCoreInit(LL_TX_POWER_0_DBM);

	funPinMode(PA8, GPIO_CFGLR_OUT_10Mhz_PP);
	funPinMode(PA9, GPIO_CFGLR_OUT_10Mhz_PP);

	while (1) {
		handle_receiving_frame(0);
	}
	
}